In [1]:
# 최근 배운 데이터분석 예제 문제입니다.
# 아래의 코드를 파이썬으로 작성하여 풀어주세요!
# 이번주도 화이팅입니다 :)

import pandas as pd

# 1. 다음 데이터를 사용하여 DataFrame을 생성하세요.
data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
        'Age': [28, 35, 42, 29],
        'City': ['New York', 'Paris', 'London', 'San Francisco']}
df = pd.DataFrame(data)
data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 35, 42, 29],
 'City': ['New York', 'Paris', 'London', 'San Francisco']}

In [5]:
# 2. 위에서 생성한 데이터프레임에 'Gender' 열을 추가하고 각 행에 'Male' 또는 'Female' 값을 할당하세요.
df = df.assign(Gender=['Male', 'Female', 'Male', 'Female'])
df

    Name  Age           City  Gender
0   John   28       New York    Male
1   Anna   35          Paris  Female
2  Peter   42         London    Male
3  Linda   29  San Francisco  Female

In [7]:
# 3. 위에서 생성한 데이터프레임의 인덱스를 'A', 'B', 'C', 'D'로 설정하세요.
df.index = ['A', 'B', 'C', 'D']
df

    Name  Age           City  Gender
A   John   28       New York    Male
B   Anna   35          Paris  Female
C  Peter   42         London    Male
D  Linda   29  San Francisco  Female

In [8]:
# 4. 위에서 생성한 데이터프레임에서 'Name' 열만 추출하여 출력하세요.
display(df['Name'])

A     John
B     Anna
C    Peter
D    Linda
Name: Name, dtype: object

In [10]:
# 5. 위에서 생성한 데이터프레임에서 'Age' 열의 값이 30 이상인 행들만 필터링하여 출력하세요.
display(df[df['Age']>= 30])

    Name  Age    City  Gender
B   Anna   35   Paris  Female
C  Peter   42  London    Male

In [17]:
# 6. 다음 두 개의 데이터프레임을 병합하세요.
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

new_df = pd.merge(df1, df2, how='outer') # outer은 합집합, inner은 교집합....
new_df

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

In [18]:
# 7. 다음 데이터프레임을 'City' 열을 기준으로 그룹화하여 'Age' 열의 평균을 출력하세요.
df = pd.DataFrame({'City': ['Seoul', 'Busan', 'Seoul', 'Busan'],
                   'Age': [25, 30, 35, 40]})
df.groupby('City')['Age'].mean()

City
Busan    35.0
Seoul    30.0
Name: Age, dtype: float64

In [19]:
# 8. 다음 데이터프레임을 'Age' 열을 기준으로 내림차순으로 정렬하세요.
df = pd.DataFrame({'Name': ['John', 'Anna', 'Peter', 'Linda'],
                   'Age': [28, 35, 42, 29],
                   'City': ['New York', 'Paris', 'London', 'San Francisco']})
df.sort_values(by=['Age'],ascending=False)

    Name  Age           City
2  Peter   42         London
1   Anna   35          Paris
3  Linda   29  San Francisco
0   John   28       New York

In [22]:
# 9. 다음 데이터프레임에서 결측값을 0 으로 채워넣으세요.
import numpy as np
df = pd.DataFrame({'A': [1, np.nan, 3, np.nan],
                   'B': [np.nan, 5, np.nan, 8],
                   'C': [10, 11, 12, 13]})
df.fillna(0)

     A    B   C
0  1.0  0.0  10
1  0.0  5.0  11
2  3.0  0.0  12
3  0.0  8.0  13

In [24]:
# 10. 다음 데이터프레임을 이용하여 'Date'를 인덱스로, 'City'를 컬럼으로 하여 피벗테이블을 생성하세요.
df = pd.DataFrame({'Date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
                   'City': ['Seoul', 'Busan', 'Seoul', 'Busan'],
                   'Value': [100, 200, 150, 250]})

pdf= pd.pivot_table(df,
               index = 'Date',
               columns= 'City',
               values = 'Value')
pdf

City        Busan  Seoul
Date
2022-01-01  200.0  100.0
2022-01-02  250.0  150.0